Repository: loginom/admin-guide-l10n
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: В случае с SOAP-сервисом выделяется содержание узла Body SOAP-пакета.
en: In the case of the SOAP service, content of the Bodynode of the SOAP package is selected.

source: В случае, если значения параметров Исходное имя файла запроса и Результирующее имя файла запроса не заданы, то будут сформированы имена файлов на основе случайно сгенерированных GUID (Globally Unique Identifier) без расширения.
en: If the values of The request file source name and The resulting name of the request file parameters are not specified, the files names will be generated according to randomly generated GUID (Globally Unique Identifier), without extension.

source: В созданном пуле приложений необходимо настроить дополнительные параметры (например, через пункт меню Определить значения по умолчанию для пула приложений… (Set Application Pool Defaults…).
en: It is required to configure the additional parameters (for example, using the following menu item: Set Application Pool Defaults… (Set Application Pool Defaults…) in the created application pool.

source: В таких случаях эти компоненты должны быть установлены на ПК вместе с Адаптером.
en: In such cases, these components must be installed with the Adapter.

source: В таком заголовке может передаваться дополнительная информация (например, имя пользователя, пароль и т.д.).
en: This type of header can include additional information (e.g., user name, password, etc.).

source: В файле Web.config допустимо использование как абсолютных путей на дополнительные файлы (с указанием буквы диска), так и относительных, которые задаются относительно расположения Web.config.
en: Use of both absolute paths to additional files (stating the drive letter), and the relative paths specified according to the location of Web.config in the Web.config file is permitted.

source: В файле Web.config при этом будут содержаться ссылки на эти файлы.
en: The Web.config file will include references to such files.

source: В хранилище сертификатов.
en: In the certificate store.

source: В этих параметрах могут быть заданы полные пути к файлам, либо только имена файлов.
en: Full paths to the files or only the files' names can be stated in these parameters.

source: В этом случае значение параметра подчиняется правилам именования элементов XML в соответствии со спецификацией W3C.
en: In this regard, the parameter value is subject to the rules of naming of the XML elements under W3C specification.

source: В этом случае соответствующие данные не логируются.
en: In this regard, corresponding data must not be logged.

source: Варианты имени файла инсталлятора:
en: The installer file name versions:

source: Веб Сервер (IIS) (Установлено 8 из 43) - Веб сервер (Установлено 8 из 34)
en: Web server (IIS) (8 installed of 43) - Web server (8 installed of 34)

source: Версия 3.5
en: Version 3.5

source: Версия 7.5 и выше
en: Version 7.5 and higher

source: Версия не ниже 5.1
en: Version 5.1 or higher

source: Взаимодействие между всеми компонентами платформы осуществляется через Loginom Server.
en: Interaction of all platform components is performed by means of the Loginom Server.

source: Взаимодействие с Адаптером из сценария Loginom происходит по стандартному SOAP-протоколу при помощи узла Вызов веб-сервиса.
en: Interaction with the Adapter from the Loginom workflow is performed according to the standard SOAP protocol using the Web service invocation node.

source: Включаем компонент WebSockets:
en: The WebSockets component is enabled:

source: Включаем функцию прокси в ARR:
en: The proxy function is enabled in ARR:

source: Включение компонентов IIS
en: Enable IIS Components

source: Включение компонентов IIS для Loginom Integrator
en: Enable IIS Components for Loginom Integrator

source: Включение компонентов IIS для Loginom Studio
en: Enable IIS Components for the Loginom Studio

source: Вместе с Адаптером могут поставляться настройки подключений (коннекторы) к таким внешним сервисам, как, например, EquifaxFPS, NationalHunter, Национальное бюро кредитных историй (НБКИ), Бюро кредитных историй — Объединенное Кредитное Бюро (БКИ — ОКБ), QiwiScoring и другим.
en: Connection settings (connectors) for such external services as, for example, EquifaxFPS, NationalHunter, National Bureau of Credit Histories (NBCH), Bureau of Credit Histories — Associated Credit Bureau (BCH— ACB), QiwiScoring, etc. can be provided with the Adapter.

source: Возможно включение следующих режимов:
en: It is possible to enable the following modes:

source: Возможные значения:
en: Possible values:

source: Время ожидания задается в секундах в параметре Таймаут.
en: The timeout period is expressed in seconds in the Timeout parameter.

source: Второй вариант проверки — перейти по URL: http://<Server>/lgi/service.svc/rest/help.
en: The second variant of checking — go to the following URL: http://<Server>/lgi/service.svc/rest/help.

source: Входящие на TCP порт 4580 для хостов с Loginom Intergator или BatchLauncher.
en: Incoming to the TCP port 4580 for hosts with Loginom Intergator or BatchLauncher.

source: Входящие на TCP порт 8080|8443 (websocket) для хостов клиентов (браузеры)
en: Incoming to the TCP port 8080|8443 (websocket) for the client hosts (browsers)

source: Выбор компонентов для установки
en: Selection of Components for Installation

source: Выбор криптопровайдера и его версии диктуется требованиями поддержки в нем необходимых для взаимодействия с конкретным веб-сервисом алгоритмов шифрования.
en: Selection of cryptography service provider and its version is stipulated by support of the definite encryption algorithms required for interaction with the particular web services.

source: Выбрать путь можно нажатием на кнопку .
en: It is possible to select a path by clicking the button.

source: Выполнение этого этапа определяется параметрами Конфигуратора: Исходное имя файла запроса, Результирующее имя файла запроса, Команда обработки файла запроса.
en: Performance of this stage can be defined by the following parameters: the Configurator: The request file source name, The resulting name of the request file, The request file processing command .

source: Выполнить в командной строке от имени администратора:
en: To execute the following command in the command line as an administrator:

source: Выполняя роль веб-сервиса, Адаптер предоставляет WSDL-описание в соответствии со стандартом SOAP.
en: Serving as a web service, the Adapter provides the WSDL description according to the SOAP standard.

source: Гб
en: GB

source: Графический интерфейс
en: Graphic Interface

source: Группа параметров настройки роли Web-сервиса:
en: The Group of the Parameters for the Web Service Role Configuration:

source: Далее выполняются операции обратные опциональным преобразованиям и XSLT трансформация с использованием параметров XSLT для трансформации ответного сообщения и Параметры XSLT.
en: Then the operations reverse to the optional transformations and XSLT transformation with usage of the XSLT for transformation of the response message, and XSLT parameters parameters are performed.

source: Далее команда ОС применяется к этому файлу и формирует выходной файл.
en: Then the OS command is applied to this file and the output file is formed.

source: Данная схема используется для формирования WSDL веб-сервиса и является обязательным компонентом настроек Адаптера.
en: This schema is used for the WSDL web service formation, and it is an obligatory component of the Adapter settings.

source: Данная схема определяет XML-структуру ответов и запросов всех методов каждого сервиса, описанного в файле конфигурации web.config, и импортируется в WSDL в разделе <wsdl:types>.
en: This schema enables the defining of the XML structure of responses and the requests of all methods of each service described in the web.config configuration file, and it is imported to WSDL in the <wsdl:types> section.

source: Данное преобразование специфично для работы с вышеуказанным БКИ и в других задачах не применяется.
en: This transformation is specific for the work with the CRB specified above, and it is not applied for other tasks.

source: Данному параметру можно задать значения true или false.
en: It is possible to set true or false values for this parameter.

source: Данные настройки включают в себя следующие параметры:
en: These settings include the following parameters:

source: Данный диалог доступен только при установке компонента Loginom Server.
en: This dialog is available only on condition of the Loginom Server component installation.

source: Данный параметр должен содержать наименование метода из wsdl-описания SOAP-сервиса.
en: This parameter must contain the method name taken from the WSDL description of the SOAP service.

source: Деинсталлировать "Loginom Desktop" можно несколькими способами:
en: Loginom Desktop can be uninstalled in several ways:

source: Деинсталлировать Loginom Adapter можно несколькими способами:
en: Loginom Adapter can be uninstalled in several ways:

source: Деинсталлировать Loginom Integrator можно несколькими способами:
en: Loginom Integrator can be uninstalled in several ways:

source: Дерево навигации настроек
en: Settings Navigation Tree

source: Дерево навигации представляет собой двухуровневую иерархическую структуру и включает в себя следующие элементы:
en: The navigation tree is a two-level hierarchical structure that includes the following elements:

source: Диалог доступен только при установке компонента Веб-сервер.
en: The dialog is available only on condition of Web server component installation.

source: Диалог доступен только при установке компонента Loginom Studio без установки компонента Веб-сервер.
en: The dialog is available only on condition of Loginom Studio component installation without the Web server component installation.

source: Для использования пакетов в качестве веб-сервиса необходимо предварительно опубликовать их в Loginom Server.
en: To use the packages as a web service, it is required to publish them in advance in the Loginom Server.

source: Для запуска Loginom Desktop требуется настройка ключей лицензирования (см.
en: To start the Loginom Desktop it is required to configure the licensing keys (refer to

source: Для запуска диагностики требуется открыть файл %ProgramFiles%\Common Files\Guardant\Drivers\grddiag.exe.
en: It is required to open %ProgramFiles%\Common Files\Guardant\Drivers\grddiag.exe file to start the diagnostic process.

source: Для запуска служб из командной строки требутся выполнить от имени администратора следующие команды:
en: To start the services from the command line, it is required to run the following commands as an administrator:

source: Для запуска служб с помощью ярлыка требуется выбрать в его контекстном меню пункт "Запуск от имени администратора".
en: To start the services using the shortcut, it is required to select the "Run as an administrator" item in the context menu.

source: Для запуска службы LoginomServer требуется настройка ключей лицензирования (см.
en: To start the LoginomServer service, it is required to configure the licensing keys (refer to

source: Для каждого используемого экземпляра Loginom Server в элементе configuration/loginom требуется добавить элемент server со следующими атрибутами:
en: It is required to add the server element for each used Loginom Server instance in the configuration/loginom element with the following attributes:

source: Для корректной работы Loginom Integrator требуется установленный NetFramework v4.5+.
en: Installed NetFramework v4.5+ is required for the proper Loginom Integrator operation.

source: Для локального ключа доступны оба варианта исполнения, но сетевой ключ доступен только в стандартном форм-факторе.
en: Both versions are available for the local dongle, but the network dongle is available only in the standard form factor.

source: Для обновления Loginom Integrator необходимо запустить инсталлятор новой версии:
en: To upgrade Loginom Integrator, it is required to run the installer (new version):

source: Для обновления достаточно установить новую версию "Loginom Desktop" поверх предыдущей.
en: It is sufficient to install the new version of "Loginom Desktop" over the previous one to upgrade it.

source: Для отображения настроек методов взаимодействия с внешним сервисом необходимо выделить соответствующий ему элемент в дереве настроек (см.
en: To display the settings of methods of interaction with the external service, it is required to select the corresponding item in the settings tree. (refer to

source: Для отображения настроек подключения к внешнему сервису необходимо выделить соответствующий ему элемент в дереве навигации (см.
en: To display the connection settings to the external service, it is required to select the corresponding item in the navigation tree (refer to

source: Для отображения общих настроек Адаптера необходимо выделить элемент Настройки в дереве навигации (см.
en: To display the Adapter general settings it is required to select the Settings item in the navigation tree (refer to

source: Для передачи отчета в техническую поддержку его требуется сохранить в html или txt формате и отправить по e-mail.
en: To transfer the report to the help desk, it is required to save it in html or txt format and send it by the following e-mail: e-mail.

source: Для получения отчёта нажмите кнопку "Полный отчёт", после чего в браузере откроется html-файл с подробным описанием всех ключей, установленных в системе, а также конфигурации системы.
en: To retrieve the report, it is required to press the "Full Report" button; then HTML file with detailed description of all dongles installed in the system and system configuration will be opened in the browser.

source: Для получения параметров существующих сайтов IIS в интерфейсе инсталлятора требуется запустить его с правами администратора.
en: To receive parameters of the existing IIS sites in the installer interface, it is required to run it with the administrator rights.

source: Для приведенного примера из SOAP-пакета будет выделен узел ded:Cheques, и дальнейшая трансформация на следующих этапах будет производиться с текстом xml:
en: The ded:Cheques node will be selected for the provided example from the SOAP package, and further transformation in the following stages will be performed with the XML text:

source: Для привязки требуется задать следующие атрибуты:
en: It is required to set the following attributes for binding:

source: Для проверки работоспособности необходимо в браузере перейти по URL: http://<Server>/lgi/service.svc?wsdl, где <Server> — имя хоста Loginom Integrator.
en: To check the operability, it is required to go to the following URL using the browser: http://<Server>/lgi/service.svc?wsdl, where <Server> — name of the Loginom Integrator host.

source: Для просмотра/изменения списка приложений нужно выбрать Посмотреть приложения из контекстного меню выбранного пула.
en: To view/change the application list, it is required to select View applications in the context menu of the selected pool.

source: Для работы Адаптера требуется наличие ряда компонентов IIS и .Net Framework.
en: The availability of some IIS and .Net Framework components is required for the Adapter operation.

source: Для работы Loginom нет необходимости устанавливать драйвер на каждую машину, достаточно просто инсталлировать программу;
en: It is not required to install driver on each computer. It is sufficient just to install the program.

source: Для работы локального ключа необходимо установить только драйвер, тогда как при использовании сетевого ключа нужен выделенный сервер, на который необходимо проинсталлировать сервер ключей.
en: It is required to install only a driver for the local dongle operation, whereas a dedicated server is used for the network dongle and a key server must be installed on it.

source: Для работы с некоторыми веб-сервисами могут использоваться сторонние криптопровайдеры (Cryptography Service Provider, CSP) и Java Runtime Environment (JRE).
en: The external cryptography service providers (Cryptography Service Provider, CSP) and Java Runtime Environment (JRE) can be used for work with some web services.

source: Для работы с программой Loginom Studio (web-интерфейс к Loginom Server)обязательным условием является наличие web-сервера.
en: Web server is mandatory for work with Loginom Studio (web interface for Loginom Server).

source: Для работы с тем или иным веб-сервисом с применением шифрования потребуются соответствующие сертификаты.
en: Corresponding certificates will be required for use of a particular web service with encryption.

source: Для решения этой задачи предназначен Loginom Adapter (далее, Адаптер).
en: Loginom Adapter provides a solution to this problem (hereafter referred to as the Adapter).

source: Для таких сертификатов в параметре Хранилище сертификатов указывается значение none.
en: none value is specified for such certificates in the Certificate store parameter.

source: Для удаления Loginom Server требуется остановить службу loginom и удалить приложение одним из способов:
en: To remove the Loginom Server, it is required to stop the loginom service and remove the application using one of the following methods:

source: Для успешной активации ключа требуется:
en: The following conditions are required for the successful dongle activation:

source: Для установки с нестандартными параметрами в диалоге "Тип установки" нажимаем кнопку "Выборочная".
en: It is required to click the Custom button for installation with nonstandard parameters in the Installation type dialog.

source: Для установки с нестандартными параметрами в диалоге Тип установки нажимаем кнопку Выборочная.
en: It is required to press the Custom button for installation with nonstandard parameters in the Installation type dialog.

source: Для физических ключей доступны два варианта исполнения: стандартный и микро.
en: Only two versions are available for physical dongles: standard and micro.

source: Для шифровании данных при интеграции с внешними веб-сервисами используются криптопровайдеры, например, Signal-COM CSP или CryptoPro CSP.
en: Cryptography service providers as Signal-COM CSP or CryptoPro CSP are used for data encryption in the case of integration with the external web services.

source: Для этого для запроса и ответа каждого метода необходимо задать имя и пространство имен соответствующего элемента схемы.
en: For this purpose, it is required to set a name and namespace of the corresponding schema element for the request and response of each method.

source: Для этого необходимо выполнить ряд действий.
en: For that purpose, it is required to perform a number of actions.

source: Добавляем в web.config:
en: It is to be added to web.config:

source: Добавляем в корневую директорию сайта файл web.config со следующим содержимым:
en: The web.config file with the following content is added to the site root directory:

source: Должен быть вставлен в USB-порт того компьютера, на котором будет запускаться Loginom;
en: It must be inserted into the USB port of the computer used for Loginom start;

source: Должен быть установлен на выделенном сервере, на котором необходимо дополнительно проинсталлировать сервер ключей;
en: It must be installed on a dedicated server and a key server must be additionally installed on it.

source: Дополнительные файлы
en: Additional Files

source: Допустимым является использование следующих вариантов web-сервера:
en: The following web server types are permitted:

source: Достоинства:
en: Advantages:

source: Доступны 32-х и 64-х разрядные редакции.
en: The 32-bit and 64-bit versions are available.

source: Его редактирование доступно в оснастке Сертификаты – текущий пользователь и вызывается командой mmc certmgr.msc.
en: It can be edited in the following snap-in: Certificates – the current user, and it can be activated using the mmc certmgr.msc command.

source: Его редактирование доступно в оснастке Сертификаты – локальный компьютер и вызывается командой mmc certlm.msc.
en: It can be edited in the following snap-in: Certificates - the local computer, and can be activated using the mmc certlm.msc command.

source: Если атрибут не задан, используются логин и пароль пользователя service.
en: If the attribute is not specified, it is required to use the service user login and password.

source: Если в настройках веб-сервера порт был изменен, то URL: http://localhost:<Порт HTTP>/app/
en: If the port was changed in the web server settings, the following URL is used: http://localhost:<HTTP port>/app/

source: Если задан атрибут table, sqlCommand будет проигнорирован.
en: If the table attribute is specified, sqlCommand will be ignored.

source: Если значение параметра XSLT для трансформации входящего сообщения перед передачей не задано, то этап XSLT трансформации не выполняется.
en: If the value of the >XSLT for transformation of the incoming message before transfer parameter is not specified, the XSLT transformation stage is not performed.

source: Если значение поля равняется значению host поля URL веб-приложения, в server.json указывается host: null.
en: If the field value is equal to host of the URL of the web application field, it is required to specify host: null in server.json.

source: Если используется несколько экземпляров Loginom Integrator, рабочие каталоги у них должны быть разными.
en: If several Loginom Integrator instances are used, the working directories must be different.

source: Если клиентский сертификат имеет закрытый ключ, то он помещается в одно из хранилищ сертификатов — в хранилище локальной машины (localMachine) или хранилище текущего пользователя (currentUser).
en: If the client certificate has a private key, it is placed into one of the certificate stores - into the local machine store (localMachine), or the current user store (currentUser)

source: Если оставить данный параметр пустым, то для формирования имен элементов в WSDL используется параметр Имя метода.
en: If this parameter is left empty to form the item names in WSDL, the Method name parameter is used.

source: Если параметр Команда обработки файла запроса не задан, то этап обработки Команда OC не выполняется.
en: If The request file processing command parameter is not specified, then the OS command processing stage is not executed.

source: Если параметр не задан, то логи не сохраняются.
en: If a parameter is not set, the logs are not saved.

source: Если предполагается использование стороннего web-сервера, компонент должен быть отключен.
en: If the third-party server is to be used, the component must be disabled.

source: Если пул не существует, он будет создан.
en: If the pool does not exist, it will be created.

source: Если таких нет, то сервер выбирается случайным образом среди доступных резервных серверов.
en: If there are no such servers, it is randomly selected among the available standby servers.

source: Жесткий диск
en: Hard disk drive

source: Журналирование
en: Logging

source: Заголовки (Message Headers)
en: Headers (Message Headers)

source: Заголовок Content-Type заполняется значением параметра ContentType для передачи в заголовке.
en: In the Content-Type header, the value of the ContentType for transfer in the header parameter is stated.

source: Заголовок SOAPAction заполняется значением параметра SOAPAction, который необходимо передавать в заголовке.
en: In the SOAPAction header, it is required to state the value of the SOAPAction that is required to transfer in the header parameter.

source: Запись в базу данных
en: Database record

source: Запись в журнал событий Windows
en: Windows Events Log Record

source: Запись в файл
en: File Record

source: Запись событий логирования
en: Logging events record
